examples/reasoner-example.org
# -*- eval: (load-library "elot-defaults") -*-
#+title: Ontology demonstrating ROBOT reasoning in ELOT 
#+subtitle: An OWL ontology
#+author: johanw
#+date: WIP (version of 2025-05-01 11:05)
#+call: theme-elot()


#+property: header-args:sh :var robot=(eval elot-robot-command-str)
#+property: header-args:sh+ :var asserted=(concat (elot-context-localname) ".ttl")
#+property: header-args:sh+ :var inferred=(concat (elot-context-localname) "-inferred.ttl")
#+property: header-args:sparql :noweb yes :eval never-export :exports results :format ttl :wrap "src ttl" :cache yes :post kill-prefixes(data=*this*)

* Use ROBOT for reasoning tasks with ELOT

** The ~reason~ command help
#+begin_src sh :results drawer
$robot help reason
#+end_src

#+RESULTS:
:results:
usage: robot reason --input <file> --reasoner <name> [options] --output
             <file>
 -a,--annotate-inferred-axioms <arg>               if true, annotate
                                                   inferred axioms with
                                                   'is_inferred true'
 -A,--axiom-generators <arg>                       specify one or more
                                                   space-separated
                                                   inferred axiom
                                                   generators
    --add-prefix <arg>                             add prefix 'foo:
                                                   http://bar' to the
                                                   output
    --add-prefixes <arg>                           add JSON-LD prefixes to
                                                   the output
    --catalog <arg>                                use catalog from
                                                   provided file
 -D,--dump-unsatisfiable <arg>                     if specified and
                                                   ontology is incoherent,
                                                   dump minimal
                                                   explanatory module here
 -d,--include-indirect <arg>                       if true, assert direct
                                                   and indirect axioms
 -e,--equivalent-classes-allowed <arg>             if 'none', any
                                                   equivalent class will
                                                   cause an error, if
                                                   'all', all equivalent
                                                   classes are allowed,
                                                   and if 'asserted-only',
                                                   inferred equivalent
                                                   classes will cause an
                                                   error.
 -h,--help                                         print usage information
 -i,--input <arg>                                  reason ontology from a
                                                   file
 -I,--input-iri <arg>                              reason ontology from an
                                                   IRI
 -m,--create-new-ontology-with-annotations <arg>   if true, output
                                                   ontology will contain
                                                   the inferences and
                                                   their annotation
                                                   properties
 -n,--create-new-ontology <arg>                    if true, output
                                                   ontology will only
                                                   contain the inferences
    --noprefixes                                   do not use default
                                                   prefixes
 -o,--output <arg>                                 save reasoned ontology
                                                   to a file
 -p,--preserve-annotated-axioms <arg>              preserve annotated
                                                   axioms when removing
                                                   redundant subclass
                                                   axioms
 -P,--prefixes <arg>                               use prefixes from
                                                   JSON-LD file
 -r,--reasoner <arg>                               reasoner to use: ELK,
                                                   HermiT, JFact
 -s,--remove-redundant-subclass-axioms <arg>       if true, remove
                                                   redundant subclass
                                                   axioms
    --strict                                       use strict parsing when
                                                   loading an ontology
 -t,--exclude-tautologies <arg>                    specify approach for
                                                   excluding tautologies:
                                                   'structural' (fast),
                                                   'all' (use HermiT,
                                                   slower), 'false' (allow
                                                   tautologies)
 -T,--exclude-owl-thing <arg>                      if true, exclude
                                                   inferences to owl:Thing
 -V,--version                                      print version
                                                   information
 -v,--verbose                                      increased logging
 -vv,--very-verbose                                high logging
 -vvv,--very-very-verbose                          maximum logging,
                                                   including stack traces
 -x,--exclude-duplicate-axioms <arg>               if true, do not add an
                                                   axiom if it exists in
                                                   import chain
 -X,--exclude-external-entities <arg>              if true, do not add an
                                                   axiom if it is about
                                                   classes in external
                                                   ontologies
:end:

# reformatted 
** usage: ~robot reason --input <file> --reasoner <name> [options] --output <file>~
 - -a,--annotate-inferred-axioms <arg> :: if true, annotate inferred
   axioms with 'is_inferred true'
 - -A,--axiom-generators <arg> :: specify one or more space-separated
   inferred axiom generators
 - --add-prefix <arg> :: add prefix 'foo: http://bar' to the output
 - --add-prefixes <arg> :: add JSON-LD prefixes to the output
 - --catalog <arg> :: use catalog from provided file
 - -D,--dump-unsatisfiable <arg> :: if specified and ontology is
   incoherent, dump minimal explanatory module here
 - -d,--include-indirect <arg> :: if true, assert direct and indirect
   axioms
 - -e,--equivalent-classes-allowed <arg> :: if 'none', any equivalent
   class will cause an error, if 'all', all equivalent classes are
   allowed, and if 'asserted-only', inferred equivalent classes will
   cause an error.
 - -h,--help :: print usage information
 - -i,--input <arg> :: reason ontology from a file
 - -I,--input-iri <arg> :: reason ontology from an IRI
 - -m,--create-new-ontology-with-annotations <arg> :: if true, output
   ontology will contain the inferences and their annotation
   properties
 - -n,--create-new-ontology <arg> :: if true, output ontology will
   only contain the inferences
 - --noprefixes :: do not use default prefixes
 - -o,--output <arg> :: save reasoned ontology to a file
 - -p,--preserve-annotated-axioms <arg> :: preserve annotated axioms
   when removing redundant subclass axioms
 - -P,--prefixes <arg> :: use prefixes from JSON-LD file
 - -r,--reasoner <arg> :: reasoner to use: ELK, HermiT, JFact
 - -s,--remove-redundant-subclass-axioms <arg> :: if true, remove
   redundant subclass axioms
 - --strict :: use strict parsing when loading an ontology
 - -t,--exclude-tautologies <arg> :: specify approach for excluding
   tautologies: 'structural' (fast), 'all' (use HermiT, slower),
   'false' (allow tautologies)
 - -T,--exclude-owl-thing <arg> :: if true, exclude inferences to
   owl:Thing
 - -V,--version :: print version information
 - -v,--verbose :: increased logging
 - -vv,--very-verbose :: high logging
 - -vvv,--very-very-verbose :: maximum logging, including stack traces
 - -x,--exclude-duplicate-axioms <arg> :: if true, do not add an axiom
   if it exists in import chain
 - -X,--exclude-external-entities <arg> :: if true, do not add an
   axiom if it is about classes in external ontologies

