examples/reasoner-example.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-05-01 tor. 15:27 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Ontology demonstrating ROBOT reasoning in ELOT</title>
<meta name="author" content="johanw" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://johanwk.github.io/elot/elot-package/elot-style.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Ontology demonstrating ROBOT reasoning in ELOT
<br />
<span class="subtitle">An OWL ontology</span>
</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org7ab6f05">1. Use ROBOT for reasoning tasks with ELOT</a>
<ul>
<li><a href="#org14b7ef2">1.1. The <code>reason</code> command help</a></li>
<li><a href="#usage:">1.2. usage: <code>robot reason --input &lt;file&gt; --reasoner &lt;name&gt; [options] --output &lt;file&gt;</code></a></li>
<li><a href="#org7f2193b">1.3. Alternatives for <code>--axiom-generators</code></a></li>
</ul>
</li>
<li><a href="#org6e00eca">2. Ontology &ldquo;reasoner-example&rdquo;</a>
<ul>
<li><a href="#org87cbda7">2.1. Queries</a>
<ul>
<li><a href="#org4e371eb">2.1.1. ROBOT command to produce a classified version of the ontology</a></li>
<li><a href="#org3673321">2.1.2. SPARQL queries</a></li>
<li><a href="#org6835d08">2.1.3. Query this ontology as asserted, no inference</a>
<ul>
<li><a href="#org94a8dbf">2.1.3.1. Asserted class taxonomy</a></li>
<li><a href="#orgc196778">2.1.3.2. Assertions on individuals</a></li>
</ul>
</li>
<li><a href="#orgdd3abb3">2.1.4. Query this ontology after inference</a>
<ul>
<li><a href="#orga582f92">2.1.4.1. Class taxonomy, after inference</a></li>
<li><a href="#org34a8604">2.1.4.2. Assertions on individuals, after inference</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org06fb10a">2.2. Prefixes</a></li>
<li><a href="#reasoner-example-ontology-declaration">2.3. reasoner-example ontology (ex:reasoner-example ex:reasoner-example/0.0)</a></li>
<li><a href="#reasoner-example-datatypes">2.4. Datatypes</a></li>
<li><a href="#reasoner-example-class-hierarchy">2.5. Classes</a>
<ul>
<li><a href="#ex:C">2.5.1. C (ex:C)</a></li>
<li><a href="#ex:D">2.5.2. D (ex:D)</a></li>
</ul>
</li>
<li><a href="#reasoner-example-object-property-hierarchy">2.6. Object properties</a>
<ul>
<li><a href="#ex:r">2.6.1. r (ex:r)</a></li>
</ul>
</li>
<li><a href="#reasoner-example-data-property-hierarchy">2.7. Data properties</a></li>
<li><a href="#reasoner-example-annotation-property-hierarchy">2.8. Annotation properties</a>
<ul>
<li><a href="#rdfs:label">2.8.1. label (rdfs:label)</a></li>
<li><a href="#owl:versionInfo">2.8.2. owl:versionInfo</a></li>
<li><a href="#dcterms:title">2.8.3. dcterms:title</a></li>
<li><a href="#dcterms:license">2.8.4. dcterms:license</a></li>
<li><a href="#dcterms:creator">2.8.5. dcterms:creator</a></li>
<li><a href="#dcterms:modified">2.8.6. dcterms:modified</a></li>
<li><a href="#dcterms:publisher">2.8.7. dcterms:publisher</a></li>
<li><a href="#dcterms:description">2.8.8. dcterms:description</a></li>
<li><a href="#dc:rights">2.8.9. dc:rights</a></li>
<li><a href="#pav:lastUpdateOn">2.8.10. pav:lastUpdateOn</a></li>
<li><a href="#skos:example">2.8.11. skos:example</a></li>
<li><a href="#skos:prefLabel">2.8.12. skos:prefLabel</a></li>
<li><a href="#skos:altLabel">2.8.13. skos:altLabel</a></li>
<li><a href="#iof-av:isPrimitive">2.8.14. iof-av:isPrimitive</a></li>
<li><a href="#skos:definition">2.8.15. skos:definition</a>
<ul>
<li><a href="#iof-av:naturalLanguageDefinition">2.8.15.1. iof-av:naturalLanguageDefinition</a></li>
<li><a href="#iof-av:primitiveRationale">2.8.15.2. iof-av:primitiveRationale</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#reasoner-example-individuals">2.9. Individuals</a>
<ul>
<li><a href="#ex:a">2.9.1. a (ex:a)</a></li>
<li><a href="#ex:b">2.9.2. b (ex:b)</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org7ab6f05" class="outline-2">
<h2 id="org7ab6f05"><span class="section-number-2">1.</span> Use ROBOT for reasoning tasks with ELOT</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org14b7ef2" class="outline-3">
<h3 id="org14b7ef2"><span class="section-number-3">1.1.</span> The <code>reason</code> command help</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-sh">$<span style="color: SystemWindowText; font-weight: bold;">robot</span> help reason
</pre>
</div>
</div>
</div>
