examples/reasoner-example.html
<div id="outline-container-reasoner-example-object-property-hierarchy" class="outline-3">
<h3 id="reasoner-example-object-property-hierarchy"><span class="section-number-3">2.6.</span> Object properties</h3>
<div class="outline-text-3" id="text-reasoner-example-object-property-hierarchy">
</div>
<div id="outline-container-ex:r" class="outline-4">
<h4 id="ex:r"><span class="section-number-4">2.6.1.</span> r (ex:r)</h4>
<div class="outline-text-4" id="text-ex:r">
<dl class="org-dl">
<dt>rdfs:comment</dt><dd>A relation that will be used to force D under C, and a to point back to itself</dd>
<dt>Domain</dt><dd><a href="#ex:C">C</a></dd>
<dt>Characteristics</dt><dd>Symmetric</dd>
</dl>
</div>
</div>
</div>
<div id="outline-container-reasoner-example-data-property-hierarchy" class="outline-3">
<h3 id="reasoner-example-data-property-hierarchy"><span class="section-number-3">2.7.</span> Data properties</h3>
<div class="outline-text-3" id="text-reasoner-example-data-property-hierarchy">
</div>
</div>
<div id="outline-container-reasoner-example-annotation-property-hierarchy" class="outline-3">
<h3 id="reasoner-example-annotation-property-hierarchy"><span class="section-number-3">2.8.</span> Annotation properties</h3>
<div class="outline-text-3" id="text-reasoner-example-annotation-property-hierarchy">
</div>
<div id="outline-container-rdfs:label" class="outline-4">
<h4 id="rdfs:label"><span class="section-number-4">2.8.1.</span> label (rdfs:label)</h4>
<div class="outline-text-4" id="text-rdfs:label">
</div>
</div>
<div id="outline-container-owl:versionInfo" class="outline-4">
<h4 id="owl:versionInfo"><span class="section-number-4">2.8.2.</span> owl:versionInfo</h4>
<div class="outline-text-4" id="text-owl:versionInfo">
</div>
</div>
<div id="outline-container-dcterms:title" class="outline-4">
<h4 id="dcterms:title"><span class="section-number-4">2.8.3.</span> dcterms:title</h4>
<div class="outline-text-4" id="text-dcterms:title">
<dl class="org-dl">
<dt>rdfs:isDefinedBy</dt><dd><a href="http://purl.org/dc/terms/">http://purl.org/dc/terms/</a></dd>
</dl>
</div>
</div>
<div id="outline-container-dcterms:license" class="outline-4">
<h4 id="dcterms:license"><span class="section-number-4">2.8.4.</span> dcterms:license</h4>
<div class="outline-text-4" id="text-dcterms:license">
<dl class="org-dl">
<dt>rdfs:isDefinedBy</dt><dd><a href="http://purl.org/dc/terms/">http://purl.org/dc/terms/</a></dd>
</dl>
</div>
</div>
<div id="outline-container-dcterms:creator" class="outline-4">
<h4 id="dcterms:creator"><span class="section-number-4">2.8.5.</span> dcterms:creator</h4>
<div class="outline-text-4" id="text-dcterms:creator">
<dl class="org-dl">
<dt>rdfs:isDefinedBy</dt><dd><a href="http://purl.org/dc/terms/">http://purl.org/dc/terms/</a></dd>
</dl>
</div>
</div>
<div id="outline-container-dcterms:modified" class="outline-4">
<h4 id="dcterms:modified"><span class="section-number-4">2.8.6.</span> dcterms:modified</h4>
<div class="outline-text-4" id="text-dcterms:modified">
<dl class="org-dl">
<dt>rdfs:isDefinedBy</dt><dd><a href="http://purl.org/dc/terms/">http://purl.org/dc/terms/</a></dd>
</dl>
</div>
</div>
<div id="outline-container-dcterms:publisher" class="outline-4">
<h4 id="dcterms:publisher"><span class="section-number-4">2.8.7.</span> dcterms:publisher</h4>
<div class="outline-text-4" id="text-dcterms:publisher">
<dl class="org-dl">
<dt>rdfs:isDefinedBy</dt><dd><a href="http://purl.org/dc/terms/">http://purl.org/dc/terms/</a></dd>
</dl>
</div>
</div>
<div id="outline-container-dcterms:description" class="outline-4">
<h4 id="dcterms:description"><span class="section-number-4">2.8.8.</span> dcterms:description</h4>
<div class="outline-text-4" id="text-dcterms:description">
<dl class="org-dl">
<dt>rdfs:isDefinedBy</dt><dd><a href="http://purl.org/dc/terms/">http://purl.org/dc/terms/</a></dd>
</dl>
</div>
</div>
<div id="outline-container-dc:rights" class="outline-4">
<h4 id="dc:rights"><span class="section-number-4">2.8.9.</span> dc:rights</h4>
<div class="outline-text-4" id="text-dc:rights">
<dl class="org-dl">
<dt>rdfs:isDefinedBy</dt><dd><a href="http://purl.org/dc/elements/1.1/">http://purl.org/dc/elements/1.1/</a></dd>
</dl>
</div>
</div>
<div id="outline-container-pav:lastUpdateOn" class="outline-4">
<h4 id="pav:lastUpdateOn"><span class="section-number-4">2.8.10.</span> pav:lastUpdateOn</h4>
<div class="outline-text-4" id="text-pav:lastUpdateOn">
<dl class="org-dl">
<dt>rdfs:isDefinedBy</dt><dd><a href="http://purl.org/pav/">http://purl.org/pav/</a></dd>
</dl>
</div>
</div>
<div id="outline-container-skos:example" class="outline-4">
<h4 id="skos:example"><span class="section-number-4">2.8.11.</span> skos:example</h4>
<div class="outline-text-4" id="text-skos:example">
<dl class="org-dl">
<dt>rdfs:isDefinedBy</dt><dd><a href="http://www.w3.org/2004/02/skos/core">http://www.w3.org/2004/02/skos/core</a></dd>
</dl>
</div>
</div>
<div id="outline-container-skos:prefLabel" class="outline-4">
<h4 id="skos:prefLabel"><span class="section-number-4">2.8.12.</span> skos:prefLabel</h4>
<div class="outline-text-4" id="text-skos:prefLabel">
<dl class="org-dl">
<dt>rdfs:isDefinedBy</dt><dd><a href="http://www.w3.org/2004/02/skos/core">http://www.w3.org/2004/02/skos/core</a></dd>
</dl>
</div>
</div>
<div id="outline-container-skos:altLabel" class="outline-4">
<h4 id="skos:altLabel"><span class="section-number-4">2.8.13.</span> skos:altLabel</h4>
<div class="outline-text-4" id="text-skos:altLabel">
<dl class="org-dl">
<dt>rdfs:isDefinedBy</dt><dd><a href="http://www.w3.org/2004/02/skos/core">http://www.w3.org/2004/02/skos/core</a></dd>
</dl>
</div>
</div>
<div id="outline-container-iof-av:isPrimitive" class="outline-4">
<h4 id="iof-av:isPrimitive"><span class="section-number-4">2.8.14.</span> iof-av:isPrimitive</h4>
<div class="outline-text-4" id="text-iof-av:isPrimitive">
<dl class="org-dl">
<dt>rdfs:isDefinedBy</dt><dd><a href="https://spec.industrialontologies.org/ontology/core/meta/AnnotationVocabulary">https://spec.industrialontologies.org/ontology/core/meta/AnnotationVocabulary</a></dd>
</dl>
</div>
</div>
<div id="outline-container-skos:definition" class="outline-4">
<h4 id="skos:definition"><span class="section-number-4">2.8.15.</span> skos:definition</h4>
<div class="outline-text-4" id="text-skos:definition">
<dl class="org-dl">
<dt>rdfs:isDefinedBy</dt><dd><a href="http://www.w3.org/2004/02/skos/core">http://www.w3.org/2004/02/skos/core</a></dd>
</dl>
</div>
<div id="outline-container-iof-av:naturalLanguageDefinition" class="outline-5">
<h5 id="iof-av:naturalLanguageDefinition"><span class="section-number-5">2.8.15.1.</span> iof-av:naturalLanguageDefinition</h5>
<div class="outline-text-5" id="text-iof-av:naturalLanguageDefinition">
<dl class="org-dl">
<dt>rdfs:isDefinedBy</dt><dd><a href="https://spec.industrialontologies.org/ontology/core/meta/AnnotationVocabulary">https://spec.industrialontologies.org/ontology/core/meta/AnnotationVocabulary</a></dd>
</dl>
</div>
</div>
<div id="outline-container-iof-av:primitiveRationale" class="outline-5">
<h5 id="iof-av:primitiveRationale"><span class="section-number-5">2.8.15.2.</span> iof-av:primitiveRationale</h5>
<div class="outline-text-5" id="text-iof-av:primitiveRationale">
<dl class="org-dl">
<dt>rdfs:isDefinedBy</dt><dd><a href="https://spec.industrialontologies.org/ontology/core/meta/AnnotationVocabulary">https://spec.industrialontologies.org/ontology/core/meta/AnnotationVocabulary</a></dd>
</dl>
</div>
</div>
</div>
</div>
<div id="outline-container-reasoner-example-individuals" class="outline-3">
<h3 id="reasoner-example-individuals"><span class="section-number-3">2.9.</span> Individuals</h3>
<div class="outline-text-3" id="text-reasoner-example-individuals">
</div>
<div id="outline-container-ex:a" class="outline-4">
<h4 id="ex:a"><span class="section-number-4">2.9.1.</span> a (ex:a)</h4>
<div class="outline-text-4" id="text-ex:a">
<dl class="org-dl">
<dt>Facts</dt><dd><a href="#ex:r">r</a> <a href="#ex:b">b</a></dd>
</dl>
</div>
</div>
<div id="outline-container-ex:b" class="outline-4">
<h4 id="ex:b"><span class="section-number-4">2.9.2.</span> b (ex:b)</h4>
<div class="outline-text-4" id="text-ex:b">
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: WIP (version of 2025-05-01 11:05)</p>
<p class="author">Author: johanw</p>
<p class="date">Created: 2025-05-01 tor. 15:27</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
